/****************************************************************************
*			2014 太原工业学院机器人队
*
* 主芯片：STM32F407。
* 文件名: app.c
* 内容简述:任务管理

*
* 文件历史:
* 版本号  日期           
* 说明
* v0.2    2014-02-14          赵  创建该文件
*****************************************************************************/
#include "includes.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/ 
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/*********************************************************************************************************
*                                             创建任务 
*********************************************************************************************************/		

/*****************定义栈**************************************/
OS_STK MOVE0_TASK_STK[MOVE0_STK_SIZE];				//创建任务堆栈空间	
OS_STK MOVE1_TASK_STK[MOVE1_STK_SIZE];				//创建任务堆栈空间	
OS_STK MOVE2_TASK_STK[MOVE2_STK_SIZE];				//创建任务堆栈空间	
OS_STK MOVE3_TASK_STK[MOVE3_STK_SIZE];				//创建任务堆栈空间	
OS_STK MOVE4_TASK_STK[MOVE4_STK_SIZE];				//创建任务堆栈空间	
OS_STK MOVE5_TASK_STK[MOVE5_STK_SIZE];				//创建任务堆栈空间	

/******************信号量声明**************************/
OS_EVENT  *task0;				  //信号量事件声明
OS_EVENT  *task1;
OS_EVENT  *task2;
OS_EVENT  *task3;
OS_EVENT  *task4;
OS_EVENT  *task5;

/*********************************************************************************************************
* 名    称 ：START_TASK
* 功能描述 : 初始化UCOS时钟节拍、创建所有任务
* 输入参数 : *p_arg
* 返回参数 : none.
* 作    者 : 
* 修    改 ：（日期、修改人名、修改原因）
* 特殊说明 : （特殊功能说明，例如：有参数检查等）
*********************************************************************************************************/
void START_TASK(void *pdata)
{
	OS_CPU_SR cpu_sr=0;	  						//用于临界区的退出与进入
	pdata = pdata; 

	OSStatInit();							
	//初始化统计任务.这里会延时1秒钟左右
	OS_ENTER_CRITICAL();						//进入临界区(无法被中断打断)    
/***********创建信号量*********/
	task0 = OSSemCreate(1);      
	task1 = OSSemCreate(0); 
	task2 = OSSemCreate(0); 
	task3 = OSSemCreate(0);
	task4 = OSSemCreate(0); 
	task5 = OSSemCreate(0);
/********建立其他的任务*******/
 	OSTaskCreate(
				MOVE0_TASK,										//任务
				(void *)   0,							        //任务开始执行时，传递给任务的参数的指针
				(OS_STK*) & MOVE0_TASK_STK[MOVE0_STK_SIZE-1],	//分配给任务的堆栈的栈顶指针   从顶向下递减
				MOVE0_TASK_PRIO);								//分配给任务的优先级
	
	OSTaskCreate(
				MOVE1_TASK,										//任务
				(void *)   0,							        //任务开始执行时，传递给任务的参数的指针
				(OS_STK*) & MOVE1_TASK_STK[MOVE1_STK_SIZE-1],	//分配给任务的堆栈的栈顶指针   从顶向下递减
				MOVE1_TASK_PRIO);								//分配给任务的优先级

	OSTaskCreate(
				MOVE2_TASK,										//任务
				(void *)   0,							        //任务开始执行时，传递给任务的参数的指针
				(OS_STK*) & MOVE2_TASK_STK[MOVE2_STK_SIZE-1],	//分配给任务的堆栈的栈顶指针   从顶向下递减
				MOVE2_TASK_PRIO);								//分配给任务的优先级
	OSTaskCreate(
				MOVE3_TASK,										//任务
				(void *)   0,							        //任务开始执行时，传递给任务的参数的指针
				(OS_STK*) & MOVE3_TASK_STK[MOVE3_STK_SIZE-1],	//分配给任务的堆栈的栈顶指针   从顶向下递减
				MOVE3_TASK_PRIO);								//分配给任务的优先级

	OSTaskCreate(
				MOVE4_TASK,										//任务
				(void *)   0,							        //任务开始执行时，传递给任务的参数的指针
				(OS_STK*) & MOVE4_TASK_STK[MOVE4_STK_SIZE-1],	//分配给任务的堆栈的栈顶指针   从顶向下递减
				MOVE4_TASK_PRIO);								//分配给任务的优先级

	OSTaskCreate(
				MOVE5_TASK,										//任务
				(void *)   0,							        //任务开始执行时，传递给任务的参数的指针
				(OS_STK*) & MOVE5_TASK_STK[MOVE5_STK_SIZE-1],	//分配给任务的堆栈的栈顶指针   从顶向下递减
				MOVE5_TASK_PRIO);								//分配给任务的优先级
										   
	OS_EXIT_CRITICAL();							//退出临界区(可以被中断打断)
		
	OSTaskSuspend(START_TASK_PRIO);				//挂起起始任务.			
}

/*********************************************************************************************************
* 名    称 ：led1_task
* 功能描述 : 
* 输入参数 : *p_arg
* 返回参数 : none.
* 作    者 : 
* 修    改 ：（日期、修改人名、修改原因）
* 特殊说明 : （特殊功能说明，例如：有参数检查等）
*********************************************************************************************************/
void MOVE0_TASK(void *pdata)
{ 	
	INT8U err;
	for(;;)
	{
		OSSemPend(task0,0,&err);
		if(err == OS_ERR_NONE)
		{	
			for(;;)
			{	
				GPIO_ToggleBits(GPIOB, GPIO_Pin_12);	
				OSTimeDly(100);			 //delay（1）为1ms	
			}
		}
	}
}
/*********************************************************************************************************
* 名    称 ：MOVE1_TASK
* 功能描述 : 
* 输入参数 : *p_arg
* 返回参数 : none.
* 作    者 : 
* 修    改 ：（日期、修改人名、修改原因）
* 特殊说明 : （特殊功能说明，例如：有参数检查等）
*********************************************************************************************************/
void MOVE1_TASK(void *pdata)
{ 	
	INT8U err;
	float a =0.1f;   //在 浮点数后加f可取消超过单精度浮点的警告 但无影响
	for(;;)
	{
		OSSemPend(task1,0,&err);
		if(err == OS_ERR_NONE)
		{	
			for(;;)
			{
				GPIO_ToggleBits(GPIOB, GPIO_Pin_12);	
				OSTimeDly(1000);			 //delay（1）为1ms	
				a = a+0.1f;
				USART_OUT(USART1,"TITR_2013\r\n"); 
			}
		}
	}
}
/*********************************************************************************************************
* 名    称 ：MOVE2_TASK
* 功能描述 : 
* 输入参数 : *p_arg
* 返回参数 : none.
* 作    者 : 
* 修    改 ：（日期、修改人名、修改原因）
* 特殊说明 : （特殊功能说明，例如：有参数检查等）
*********************************************************************************************************/
void MOVE2_TASK(void *pdata)
{ 	
	INT8U err;
	for(;;)
	{
		OSSemPend(task2,0,&err);
		if(err == OS_ERR_NONE)
		{
			for(;;)
			{
				GPIO_ToggleBits(GPIOB, GPIO_Pin_12);	
				OSTimeDly(100);			 //delay（1）为1ms				
			}
		}
	}
}
/*********************************************************************************************************
* 名    称 ：MOVE3_TASK
* 功能描述 :
* 输入参数 : *p_arg
* 返回参数 : none.
* 作    者 : 
* 修    改 ：（日期、修改人名、修改原因）
* 特殊说明 : （特殊功能说明，例如：有参数检查等）
*********************************************************************************************************/
void MOVE3_TASK(void *pdata)
{ 	
	INT8U err;
	for(;;)
	{
		OSSemPend(task3,0,&err);
		if(err == OS_ERR_NONE)
		{
			for(;;)
			{
				GPIO_ToggleBits(GPIOB, GPIO_Pin_12);	
				OSTimeDly(100);			 //delay（1）为1ms				
			}
		}
	}
}
/*********************************************************************************************************
* 名    称 ：MOVE4_TASK
* 功能描述 : 
* 输入参数 : *p_arg
* 返回参数 : none.
* 作    者 : 
* 修    改 ：（日期、修改人名、修改原因）
* 特殊说明 : （特殊功能说明，例如：有参数检查等）
*********************************************************************************************************/
void MOVE4_TASK(void *pdata)
{ 	
	INT8U err;
	for(;;)
	{
		OSSemPend(task4,0,&err);
		if(err == OS_ERR_NONE)
		{
			for(;;)
			{
				GPIO_ToggleBits(GPIOB, GPIO_Pin_12);	
				OSTimeDly(100);			 //delay（1）为1ms				
			}
		}
	}
}
/*********************************************************************************************************
* 名    称 ：MOVE5_TASK
* 功能描述 : 
* 输入参数 : *p_arg
* 返回参数 : none.
* 作    者 : 
* 修    改 ：（日期、修改人名、修改原因）
* 特殊说明 : （特殊功能说明，例如：有参数检查等）
*********************************************************************************************************/
void MOVE5_TASK(void *pdata)
{ 	
	INT8U err;
	for(;;)
	{
		OSSemPend(task5,0,&err);
		if(err == OS_ERR_NONE)
		{
			for(;;)
			{
				GPIO_ToggleBits(GPIOB, GPIO_Pin_12);	
				OSTimeDly(100);			 //delay（1）为1ms				
			}
		}
	}
}



